// Вывести квадрат числа
// int n = new Random().Next(1, 10);
Console.WriteLine("Введите число: ");
int n = int.Parse(Console.ReadLine());
Console.WriteLine("Квадрат числа = " + n*n);